Tekla.Structures.CatalogInternal.CDelegateSynchronized.CleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.CleanAndModifyShapeByName(System.String,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatEnumerateShapes(Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatCleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatCleanAndModifyShapeByName(System.String,System.Boolean@)
